fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресДанных") Тогда
		ДанныеИзХранилища = ПолучитьИзВременногоХранилища(Параметры.АдресДанных);
		Объект.ОтпускаСотрудников.Загрузить(ДанныеИзХранилища); 
		
		Если ТипЗнч(ДанныеИзХранилища) = Тип("ТаблицаЗначений") Тогда
			ЗаполнитьДиаграммуГанта(ДанныеИзХранилища);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьДиаграммуГанта(ТаблицаДанных)
	
	ДиаграммаГанта.Очистить();
	ДиаграммаГанта.ОтображатьЛегенду = Ложь;
	ШкалаВремени = ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
	ШкалаВремени.Единица = ТипЕдиницыШкалыВремени.Месяц;
	ШкалаВремени.Формат = "ДФ=MMММ";
	
	Серия = ДиаграммаГанта.УстановитьСерию("Отпуск");
	
	Для Каждого Стр Из ТаблицаДанных Цикл
		Точка = ДиаграммаГанта.УстановитьТочку(Стр.Сотрудник);
		Точка.Текст = Стр.Сотрудник;
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Стр.ДатаНачала;
		Интервал.Конец = Стр.ДатаОкончания;
		Интервал.Текст = СтрШаблон("%1 - %2", Формат(Интервал.Начало, "ДФ=dd.MM"), Формат(Интервал.Конец, "ДФ=dd.MM"));
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
